[
  {
    "ayah": "And establish prayer and give zakah. (2:110)",
    "action": "Pray on time today and give charity"
  },
  {
    "ayah": "Indeed, Allah loves those who rely upon Him. (3:159)",
    "action": "Trust Allah in a decision you’re worried about"
  },
  {
    "ayah": "Kind words and forgiveness are better than charity followed by injury. (2:263)",
    "action": "Say something kind to someone you argued with"
  },
  {
    "ayah": "Help one another in righteousness and piety. (5:2)",
    "action": "Help a family member or friend in need today"
  },
  {
    "ayah": "Do not walk arrogantly on the earth. (17:37)",
    "action": "Practice humility in your interactions today"
  },
  {
    "ayah": "Feed the needy and the orphan. (76:8)",
    "action": "Give food or assistance to someone in need"
  },
  {
    "ayah": "Do not consume one another’s wealth unjustly. (2:188)",
    "action": "Check your transactions for fairness and honesty"
  },
  {
  "ayah": "(2:83) And recall when We made a covenant with the Children of Israel: “You shall serve none but Allah and do good to parents, kinsmen, orphans and the needy; you shall speak kindly to people, and establish Prayer and give Zakah (Purifying Alms).”",
  "action": "Serve Allah alone today, be kind to family and neighbors, help those in need, and speak kindly to people"
}
,
  {
    "ayah": "And whoever endures patiently and forgives—surely this is a resolve to aspire to.(42:43)",
    "action": "Forgive someone who hurt you"
  },
  {
    "ayah": "Do not despair of the mercy of Allah. (39:53)",
    "action": "Reflect on Allah’s mercy in your life"
  },
  {
    "ayah": "˹O Prophet!˺ Tell the believing men to lower their gaze and guard their chastity. That is purer for them. Surely Allah is All-Aware of what they do.(24:30)",
    "action": "Practice modesty and respect in your behavior"
  },
  {
    "ayah": "Spend from what We have provided you. (2:267)",
    "action": "Give charity even if it’s small today"
  },
  {
    "ayah": "Keep your promises and covenants. (17:34)",
    "action": "Honor your commitments today"
  },
  {
    "ayah": "Help orphans and feed the needy. (107:2-3)",
    "action": "Volunteer or donate to a charitable cause"
  },
  {
    "ayah": "Do not ridicule others, for they may be better than you. (49:11)",
    "action": "Avoid mocking or judging anyone today"
  },
  {
    "ayah": "Do not kill the soul which Allah has forbidden. (6:151)",
    "action": "Protect life and avoid harmful actions"
  },
  {
    "ayah": "O you who have believed, be persistently standing firm in justice, witnesses for Allah, even if it be against yourselves or parents and relatives. (4:135)",
    "action": "Be fair in your decisions today"
  },
  {
    "ayah": "Spend in the cause of Allah and do not let your own hands throw you into destruction ˹by withholding˺. And do good, for Allah certainly loves the good-doers.(2:195)",
    "action": "Do a good deed sincerely today"
  },
  {
    "ayah": "And [remember] when your Lord proclaimed, 'If you are grateful, I will surely increase you [in favor]; but if you deny, indeed, My punishment is severe(14:7)",
    "action": "List 3 things you are grateful for today"
  },
  {
    "ayah": "Consult them in affairs. (3:159)",
    "action": "It is out of Allah's mercy that you ˹O Prophet˺ have been lenient with them. Had you been cruel or hard-hearted, they would have certainly abandoned you."
  }
]
